"""
Python file for gojuuon information.
"""
# pay attention to checking "he"
HIRAGANAS = (
    ('あ', 'い', 'う', 'え', 'お'),
    ('か', 'き', 'く', 'け', 'こ'),
    ('さ', 'し', 'す', 'せ', 'そ'),
    ('た', 'ち', 'つ', 'て', 'と'),
    ('な', 'に', 'ぬ', 'ね', 'の'),
    ('は', 'ひ', 'ふ', 'へ', 'ほ'),
    ('ま', 'み', 'む', 'め', 'も'),
    ('や', None, 'ゆ', None, 'よ'),
    ('ら', 'り', 'る', 'れ', 'ろ'),
    ('わ', 'ゐ', None, 'ゑ', 'を'),
    ('が', 'ぎ', 'ぐ', 'げ', 'ご'),
    ('ざ', 'じ', 'ず', 'ぜ', 'ぞ'),
    ('だ', 'ぢ', 'づ', 'で', 'ど'),
    ('ば', 'び', 'ぶ', 'べ', 'ぼ'),
    ('ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ'),
)

HIRA_HATSUON = 'ん'

KATAKANAS = (
    ('ア', 'イ', 'ウ', 'エ', 'オ'),
    ('カ', 'キ', 'ク', 'ケ', 'コ'),
    ('サ', 'シ', 'ス', 'セ', 'ソ'),
    ('タ', 'チ', 'ツ', 'テ', 'ト'),
    ('ナ', 'ニ', 'ヌ', 'ネ', 'ノ'),
    ('ハ', 'ヒ', 'フ', 'ヘ', 'ホ'),
    ('マ', 'ミ', 'ム', 'メ', 'モ'),
    ('ヤ', None, 'ユ', None, 'ヨ'),
    ('ラ', 'リ', 'ル', 'レ', 'ロ'),
    ('ワ', 'ヰ', None, 'ヱ', 'ヲ'),
    ('ガ', 'ギ', 'グ', 'ゲ', 'ゴ'),
    ('ザ', 'ジ', 'ズ', 'ゼ', 'ゾ'), 
    ('ダ', 'ヂ', 'ヅ', 'デ', 'ド'), 
    ('バ' ,'ビ', 'ブ', 'ベ', 'ボ'), 
    ('パ', 'ピ', 'プ', 'ペ', 'ポ'), 
)


HIRA_YOUONS = ('ゃ', 'ゅ', 'ょ')
KATA_YUONS = ('ャ', 'ュ', 'ョ')

DAKUON_MAP = {
    'か': 'が',
    'さ': 'ざ',
    'た': 'だ',
    'は': 'ば',
}
DAKUON_REV_MAP = dict(map(reversed, DAKUON_MAP.items()))

HANDAKUON_MAP = {
    'は': 'ぱ'
}
